Revit.Elements.FamilyInstance.ByHostAndPoint(Revit.Elements.FamilyType,Revit.Elements.Element,Autodesk.DesignScript.Geometry.Point)
Place a Revit FamilyInstance given the FamilyType (also known as the FamilySymbol in the Revit API) and its host element and location.
familyType: Family Type. Also called Family Symbol.
host: The object into which the FamilyInstance is to be inserted, often known as the host.
point: The physical location where the instance is to be placed.
Returns:

Revit.Elements.FamilyInstance.GetHost
Gets the host of this family instance (if any). Eg. returns the wall of a window or door family instance.